'''
2. Для списка реализовать обмен значений соседних элементов, т.е.
Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
При нечетном количестве элементов последний сохранить на своем месте.
Для заполнения списка элементов необходимо использовать функцию input().
'''

# Создаем список и уточняем у пользователя сколько элементов он добавит в него
my_list = []
numbers = int(input("Сколько элементов вы хотите добавить в список? >>> "))
n = 0

# Делаем проверку
if 0 < numbers:
    print()
else:
    print("Всего хорошего")
    exit()

# Заполняем список из пользовательского ввода
while n < numbers:
    el = input(f"Под номером {n + 1} в списке будет значиться >>> ")
    my_list.append(el)
    n += 1

# Выводим получившийся список
print(f"Наш список: {my_list}")

# Меняем местами элементы в списке
if len(my_list) % 2 == 0:
    i = 0
    while i < len(my_list):
        el = my_list[i]
        my_list[i], my_list[i + 1] = my_list[i + 1], el
        i += 2
else:
    i = 0
    while i < len(my_list) - 1:
        el = my_list[i]
        my_list[i], my_list[i + 1] = my_list[i + 1], el
        i += 2

# Вывод результата
print(f"Отформатированный список: {my_list}")
