"""
6. *Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
Каждый кортеж хранит информацию об отдельном товаре.
В кортеже должно быть два элемента — номер товара и словарь с параметрами
(характеристиками товара: название, цена, количество, единица измерения).
Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
-----
Необходимо собрать аналитику о товарах.
Реализовать словарь, в котором каждый ключ — характеристика товара, например название,
а значение — список значений-характеристик, например список названий товаров.
"""

# Создаем пустой список
products = []

# Заполняем этот список из пользовательского ввода
while input("Вы хотите добавить продукт? (Да/Нет) >>> ") == 'Да':
    number = int(input("Введите номер продукта >>> "))
    features = {}
    while input("Вы хотите добавить характеристику продукту? (Да/Нет) >>> ") == 'Да':
        feature_name = input("Введите название характеристики >>> ")
        feature_value = input("Введите значение характеристики >>> ")
        features[feature_name] = feature_value
    products.append(tuple([number, features]))

# Выводим результат
print(products)

# Создаем пустой словарь для аналитики
analitics = {}

# Собираем аналитику о товарах
for product in products:
    for feature_name, feature_value in product[1].items():
        if feature_name in analitics:
            analitics[feature_name].append(feature_value)
        else:
            analitics[feature_name] = [feature_value]

# Выводим результат
print(analitics)
