'''
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
'''

# Задаем словарь и список
month_dict = {
    1: "Зима",
    2: "Зима",
    3: "Весна",
    4: "Весна",
    5: "Весна",
    6: "Лето",
    7: "Лето",
    8: "Лето",
    9: "Осень",
    10: "Осень",
    11: "Осень",
    12: "Зима"
}
month_list = list(month_dict.values())

# Уточняем у пользователя месяц
numbers = int(input("Укажите номер месяца(1-12) >>> "))

# Делаем проверку и выводим результат
if 0 < numbers <= 12:
    print("Это решение через dict")
    print(month_dict.get(numbers))
    print("Это решение через list")
    print(month_list[numbers - 1])
else:
    print("Указан некорректный месяц")
