"""
4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
Вывести каждое слово с новой строки.
Строки необходимо пронумеровать.
Если в слово длинное, выводить только первые 10 букв в слове.
"""

# Запрашиваем у пользователя строку
custom_string = input("Введите строку из нескольких слов, разделенных пробелами >>> ")
new_string = custom_string.split(' ')

# Выводим результат, присваивая словам номер и, если слово длиннее 10 букв, сокращая его.
for i, el in enumerate(new_string, 1):
    if len(el) > 10:
        el = el[0:10]
    print(f"{i}. {el}")
